Catalogs/КлассификаторВидовПредпринимательскойДеятельностиЕНВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>КлассификаторВидовПредпринимательскойДеятельностиЕНВД</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрацияПоМестуНахожденияОрганизации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяДоходность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФизическогоПоказателя</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФизическиеПоказатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИмяФизическогоПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаФизическогоПоказателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторВидовПредпринимательскойДеятельностиЕНВД/Forms/ФормаВыгрузкиКлассификатора/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.Код КАК Код,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.Наименование,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.НаименованиеПолное,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.РегистрацияПоМестуНахожденияОрганизации,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.БазоваяДоходность,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.ИмяФизическогоПоказателя,
	|	КлассификаторВидовПредпринимательскойДеятельностиЕНВД.ПодсказкаФизическогоПоказателя
	|ИЗ
	|	Справочник.КлассификаторВидовПредпринимательскойДеятельностиЕНВД КАК КлассификаторВидовПредпринимательскойДеятельностиЕНВД
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код";
	
	ТаблицаВидовПредпринимательскойДеятельностиЕНВД = Запрос.Выполнить().Выгрузить();
	
	ТаблицаВидовПредпринимательскойДеятельностиЕНВД.Колонки.Добавить(
		"ФизическийПоказатель",
		ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	Для Каждого СтрокаТаблицы Из ТаблицаВидовПредпринимательскойДеятельностиЕНВД Цикл
		ИмяФизическогоПоказателя = СтрокаТаблицы.ИмяФизическогоПоказателя;
		Если ЗначениеЗаполнено(ИмяФизическогоПоказателя) Тогда
			СтрокаТаблицы.ФизическийПоказатель = ОбщегоНазначения.ИмяЗначенияПеречисления(ИмяФизическогоПоказателя);
		КонецЕсли;
	КонецЦикла;
	ТаблицаВидовПредпринимательскойДеятельностиЕНВД.Колонки.Удалить("ИмяФизическогоПоказателя");
	
	СтрокаXML = ОбщегоНазначения.ЗначениеВСтрокуXML(ТаблицаВидовПредпринимательскойДеятельностиЕНВД);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.УстановитьТекст(СтрокаXML);
	
КонецПроцедуры

#КонецОбласти
